package step.learning.oop;

public interface Copyable {
}

/*
Інтерфейси (В ООП) - абстрактні класи, які містять
 - тільки методи
 - тільки абстрактні
 - тільки public
Роль інтерфейсів залежить від галузі використання
 - інтерфейси-маркери: як правило, інтерфейси без методів (або з малоб кількістю),
    які помічають класи як такі, що належать до певної групи
 - інтерфейси-контракти: набір методів, необхідних для реалізації з метою
    включення об'єктів у певну функціональність
 - DIP (принцип з SOLID) Dependency Inversion Principle
* */