package oop;

public class OopDemo {
    public void run()
    {
        Book book = new Book("D.Knuth", "Art of programming");
        System.out.println(book.GetCard());
        //Library library = new Library();
        //library.add(book);
        //library.printAllCards();
    }
}

/*
Бібліотека
Моделюємо многосховище (бібліотеку) у якому є каталог (перелік наявних видань)
Видання є різного типу: книги, газети, журнали, тощо
Кожен тип має однакову картку у каталозі

Абстрагування
Література - термін, що поєднує реальні сутності (книги)
* */

/*
ООП - об'єктно-орієнтована парадигма програмування
Програма - управління об'єктами та їх взаємодією
Програмування - налаштування об'єктів та зв'язків
Види зв'язків:
 - спадкування
 - асоціація
 - композиція
 - агрегація
 - залежність
* */